CREATE DATABASE java_database;
USE java_database;

CREATE TABLE `students` (
                            `id` int NOT NULL AUTO_INCREMENT,
                            `last_name` varchar(50) DEFAULT NULL,
                            `first_name` varchar(50) DEFAULT NULL,
                            `middle_name` varchar(50) DEFAULT NULL,
                            `birth_date` date DEFAULT NULL,
                            `student_id` int DEFAULT NULL,
                            `gradebook_id` int DEFAULT NULL,
                            PRIMARY KEY (`id`)
);

INSERT INTO `students` VALUES
                           (1,'Смирнов','Александр','Иванович','2001-03-15',123456,1232312),
                           (2,'Иванова','Анна','Сергеевна','2000-07-20',234567,2131213),
                           (3,'Кузнецов','Максим','Алексеевич','1999-02-10',345678,4432232),
                           (4,'Попова','Екатерина','Владимировна','2000-12-30',456789,5432423),
                           (5,'Соколов','Дмитрий','Александрович','2002-04-25',567890,6343422),
                           (6,'Лебедев','Анастасия','Алексеевна','2003-09-05',678901,6243236),
                           (7,'Козлов','Ирина','Петровна','2001-11-12',789012,2131244),
                           (8,'Новиков','Артем','Александрович','1998-08-03',890123,8675645),
                           (9,'Морозов','Алексей','Алексеевич','2000-06-18',901234,3425673),
                           (10,'Петров','Сергей','Владимирович','1999-03-22',112233,2354564),
                           (11,'Волков','Кристина','Дмитриевна','2002-10-09',223344,5678346),
                           (12,'Смирнова','Ольга','Сергеевна','2001-01-08',334455,3434787),
                           (13,'Иванов','Андрей','Иванович','1998-04-14',445566,3424562),
                           (14,'Федорова','Марина','Андреевна','2002-07-29',556677,1234654),
                           (15,'Алексеев','Артем','Сергеевич','1999-09-16',667788,9808767);
                           (16,'Сидоров','Наталья','Игоревна','2003-05-04',778899,3232457),
                           (17,'Михайлов','Денис','Дмитриевич','2000-08-28',889900,5454544),
                           (18,'Александрова','Татьяна','Александровна','1997-12-11',990011,2445677),
                           (19,'Федоров','Евгений','Петрович','2001-03-26',112233,5454789),
                           (20,'Андреев','Олег','Андреевич','1998-10-17',223344,9087776);